# Задание 3
# Пользователь вводит с клавиатуры две цифры. Необходимо создать число, содержащее эти цифры. Например, если с клавиатуры введено 9, 7, тогда нужно сформировать число 97.

d1 = input('Введите первую цифру >')
d2 = input('Введите вторую цифру >')

d3 = int(d1 + d2)

print(d3)