# Задание 3
# Есть некоторый текст. Посчитайте в этом тексте количество предложений и выведите на экран полученный
# результат.

text = 'Есть некоторый текст. Посчитайте в этом тексте количество предложений и выведите на экран полученный результат.'

print(f'В тексте предложений: {text.count('.')}')