# Задание 1
# Напишите функцию, которая отображает на экран
# форматированный текст, указанный ниже:
# “Don't compare yourself with anyone in this world…
# if you do so, you are insulting yourself.”
# Bill Gates

def citate():
    print('"Don\'t compare yourself with anyone in this world…\nif you do so, you are insulting '
          'yourself.”\n\t\t\t\t\t\t\t\t\t\tBill Gates')


citate()
print('\n\n')
