# Задание 2
# Показать на экране таблицу умножения для всех чисел
# от 1 до 10. Например:
# 1 * 1 = 1 1 * 2 = 2 ….. 1 * 10 = 10
# .........................................................................
# 10 * 1 = 10 10 * 2 = 20 …. 10 * 10 = 100.

for i in range(1, 11):
    for j in range(1, 11):
        print(f'{i} * {j} = {i * j}', end=' ')
    print('')