# 1) Выведите все числа от 1 до 10 с использованием цикла for

# for i in range(1, 11):
#     print(i)

# 2) Выведите все числа от 10 до 1 с использованием цикла while

# x = 10
# while x != 0:
#     print(x)
#     x -= 1

# 3) Посчитайте сумму всех чисел от 1 до 10 с использованием цикла for

# sum = 0
# for i in range(1, 11):
#     sum += i
# print(sum)

# 4) Выведите все квадраты чисел от 1 до 10 с использованием цикла for
#
# for i in range(1, 11):
#     print(i ** 2)

# 5) Посчитайте сумму квадратов всех чисел от 1 до 10 с использованием цикла while

# sum = 0
# x = 1
# while x != 11:
#     sum += x ** 2
#     x += 1
# print(sum)

# 6) Выведите таблицу умножения на число 5 с использованием цикла for

# for i in range(1, 11):
#     print(5 ** i)

# 7) Выведите только четные числа от 1 до 10 с использованием цикла while

# x = 1
# while x != 11:
#     if x % 2 == 0:
#         print(x)
#     x += 1

# 8) Посчитайте сумму всех нечетных чисел от 1 до 10 с использованием цикла for

# sum = 0
# for i in range(1, 11):
#     if i % 2 != 0:
#         sum += i
# print(sum)

# 9) Выведите все числа от 1 до 10 в обратном порядке с использованием цикла for

# for i in range(10, 0, -1):
#     print(i)

# 10) Посчитайте факториал числа 5 (5!) с использованием цикла for
# x = 1
# for i in range(1, 6):
#     x = x * i
# print(x)