# Задание 2
# Пользователь с клавиатурывводит трёхзначное число.
# Например, 891. Нужно показать на разных строках значение первого, второго и третьего разряда. Также нужно
# показать на отдельной строке сумму этих трёх чисел.
# 8
# 9
# 1
# 18

numbers = input('Введите трёхзначное число >')



if len(numbers) > 3 or len(numbers) < 3:
    print('Введите ТРЁХЗНАЧНОЕ ЧИСЛО!!!')
else:
    print(numbers[0], numbers[1], numbers[2], sep = '\n' )
    print("Сумма = ", int(numbers[0]) + int(numbers[1]) + int(numbers[2]))

