# Написать программу подсчета стоимости разговора
# для разных мобильных операторов. Пользователь вводит
# стоимость разговора и выбирает с какого на какой оператор он звонит. Вывести стоимость на экран.

tarif1 = int(input('Сколько стоит минута разговора с Билайна на Билайн > '))
tarif2 = int(input('Сколько стоит минута разговора с Билайна на Теле2 > '))

time = int(input('Сколько минут Вы разговаривали > '))
call = input('Ваш звонок был:\n1.Билайн - Билайн;\n2.Билайн - Теле2.\n>>>')

if call.lower() == 'билайн - билайн' or call == '1':
    print(f'Ваш звонок стоил {time * tarif1}')
elif call == '2' or call.lower() == 'билайн - теле2':
    print(f'Ваш звонок стоил {time * tarif2}')